/* REXX */


"ALLOC FI(IN) DA('ZDO.AOC2020.D01.INPUT') SHR"
"EXECIO * DISKR IN (STEM entries. FINIS"
"FREE FI(IN)"



/* Let's keep tab on performance :) */
tries = 0
maxtries = entries.0 * entries.0 * entries.0
do a = 1 to entries.0
  if entries.a > 2020 then iterate
  do i = 1 to entries.0
    if i = a then iterate
    if entries.a + entries.i > 2020 then iterate
    if entries.i > 2020 then iterate
    do j = 1 to entries.0
      if j = i then iterate
      if entries.j > 2020 then iterate
      if entries.a + entries.i + entries.j = 2020 then do
        say "entry "a" and entry "i" and entry "j" add up to 2020"
        say "the answer is "entries.a * entries.i * entries.j
        say "Score:"tries"/"maxtries" ("100-tries/maxtries*100"%)"
        /* Comment below to see all solutions */
        exit

      end
      else
        tries = tries + 1
    end
  end
end
